{
    "About Me": "I'm a self-taught software/web developer located in Orange County California. I got into computer programming when I was looking for a hobby during the COVID lockdown, but it has evolved to be a part of my daily life. I am always interested in new ways to do things, new ideas for me to try, and more challenges to take on. During my free time outside of work, school, and excersize, you will probably find me watching a VSauce YouTube video, gaming, or scrolling StackOverflow to find any questions that haven't already been answered. I am convinced that I can do anything I set my mind to which has allowed me to persevere through hours of reading documentation, watching tutorial videos, and tough problems. What I believe sets me out apart from others is my passion for learning and programming. I code for fun, to challenge myself, and to feel satisfied after a particularly hard problem. My love of coding combined with my learning speed has allowed me to use web resources to teach myself how to code in Python, C++, and JavaScript. As for my style of coding, I code in a modular manner, meaning my code can be reused and is constructed in a way that makes it understandable with minimal comments. Overall, I am a hard-working, passionate developer who wont stop at anything to learn what it takes to be excelent in my craft.",
    "JavaScript": "I am an intermediate JavaScript programmer. I have completed the Fullstack Developer Bootcamp @ UCI in addition to coding many of my own independant projects which was mainly focused on the Node.js environment and web app development. I have worked with libraries and APIs such as OpenLayers, Google Maps, Wikimedia, Open Streetmaps and many more. I have also worked with React, Node, Express, and Three.js. What I really like about JavaScript is its flexibility and its ability to be used in a variety of different environments. It can be used to create web applications (with Create React App and Express), mobile or desktop applications (with React native), or even games (with Three.js). It also has an easy to digest syntax which makes it very easy to learn new libraries and APIs. Most of the projects that I have displayed here are examples of projects that I have created using JavaScript. I have a love for data driven applications, as they provide an enjoyment to me the same way a kid feels enjoyment when he solves the maze on the back of a menu. As for data structures, JavaScript allows me to choose whichever I like as it provides support for databases like Sequelize, SQLite, MongoDB, Neo4J, as well as its own built-in JSON format. JavaScript is what makes the internet, the internet, and I believe it is important for me to put in the time to master it.",
    "Python": "Python was the first language I started coding in. I like how simple and straight forward it is, and it allows you to quickly create UI (with PyQt5 and Tkinter), process large amounts of data with its scientific stack (pandas, Numpy, SymPy and Scipy), or build web servers/APIs (with Django). Learning all of this has allowed me to create projects such as a Rubik's Cube automattic solver, a web scraper for the harvesting of Wikipedia pages, and a graphing calculator using SymPy and Pygame. I also have the majority of my algorithm structure and composition practice in Python via websites like <a href='https://leetcode.com/'>LeetCode</a>. I have many hours developing my own projects using Python, and I am currently working on a project that uses Python to create a web server that allows users to deploy their own web scrapers onto the cloud. I am willing to learn new Python libraries and frameworks even if my main focus is JavaScript right now."
}